---
kind: property
id: P:Autodesk.Revit.DB.PaperSizeSet.IsEmpty
source: html/b7a1eebf-cb15-f2e9-8638-19c8756b7464.htm
---
# Autodesk.Revit.DB.PaperSizeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.